<a href="https://colab.research.google.com/github/M-mitra-IN/DS-AI-ML-ASD-Assignment/blob/main/Day_4_assessment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [35]:
import pandas as pd

In [36]:
#1
fruits = ['apple','banana','oranges','grapes','mangoes']
f = pd.Series(fruits)
print(f)

print("\nThrid fruit: ", f[3])

0      apple
1     banana
2    oranges
3     grapes
4    mangoes
dtype: object

Thrid fruit:  grapes

In [37]:
#2
students = ["Raj","Anu","Shekhar","Namita","Nancy","Ahana","Rakesh","Shivam"]
scores = [80,90,95,85,88,99,86,75]
report = pd.Series(scores,students)
print("Anu Scored: ", report["Anu"])

Anu Scored:  90

In [38]:
#3
d ={
    "Name": ["Raj","Anu","Shekhar","Namita","Nancy","Ahana","Rakesh","Shivam"],
    "Age": [18,17,18,19,17,21,22,21],
    "Marks": [80,90,95,85,88,99,86,75],
}
df = pd.DataFrame(d)
print(df[["Age"]])

   Age
0   18
1   17
2   18
3   19
4   17
5   21
6   22
7   21

In [39]:
#4
d={
    "Name": ["Raj","Anu","Shekhar","Namita","Nancy","Ahana","Rakesh","Shivam"],
    "Salary": [18000,17500,18500,19000,17000,23000,22000,21000],
    "Department": ["IT","Sanitation","Accounts","Cashier","Stock","HR","Sales","Security"],
    "Phone Number": ['9763847201', '8123094756', '9018473629', '7839201746', '8937462017',
 '9048573621', '7890321456','9090678754']
}
df = pd.DataFrame(d)
print(df.loc[0,'Name':'Salary'])

Name        Raj
Salary    18000
Name: 0, dtype: object

In [40]:
#5
student ={
    "Name": ["Raj","Anu","Shekhar","Namita","Nancy","Ahana","Rakesh","Shivam"],
    "Age": [18,17,18,19,17,21,22,21],
    "Marks": [80,90,95,85,88,99,86,75],
    "Roll": [10,25,35,40,45,16,17,38]
}
df = pd.DataFrame(student)
print(df.iloc[0:3])

      Name  Age  Marks  Roll
0      Raj   18     80    10
1      Anu   17     90    25
2  Shekhar   18     95    35

In [41]:
#6
customer ={
    "Name": ["Raj","Anu","Shekhar","Namita","Nancy","Ahana","Rakesh","Shivam"],
    "Age": [18,17,18,19,17,21,22,21],
    "Reward Points": [80,90,95,85,88,99,86,75],
    "Items Bought": [10,25,35,40,45,16,17,38],
    "Phone Number": ['9763847201', '8123094756', '9018473629', '7839201746', '8937462017',
 '9048573621', '7890321456','9090678754']
}
df = pd.DataFrame(customer)
df.at[2,'Name'] = "Ratan"
print(df)

     Name  Age  Reward Points  Items Bought Phone Number
0     Raj   18             80            10   9763847201
1     Anu   17             90            25   8123094756
2   Ratan   18             95            35   9018473629
3  Namita   19             85            40   7839201746
4   Nancy   17             88            45   8937462017
5   Ahana   21             99            16   9048573621
6  Rakesh   22             86            17   7890321456
7  Shivam   21             75            38   9090678754

In [42]:
#7
NaN = float('nan')
student ={
    "Name": ["Raj","Anu","Ratan","Shekhar","Namita","Amar","Nancy","Ahana","Rakesh","Shivam","Rupa","Shreya"],
    "Age": [18,17,18,19,17,21,22,21,21,23,24,22],
    "Marks": [80,90,NaN,95,85,NaN,88,99,86,75,NaN,NaN],
    "Roll": [10,25,35,40,45,16,17,38,11,12,26,34]
}
df = pd.DataFrame(student)
df['Marks'] = df['Marks'].fillna(df['Marks'].mean())
print(df)

       Name  Age  Marks  Roll
0       Raj   18  80.00    10
1       Anu   17  90.00    25
2     Ratan   18  87.25    35
3   Shekhar   19  95.00    40
4    Namita   17  85.00    45
5      Amar   21  87.25    16
6     Nancy   22  88.00    17
7     Ahana   21  99.00    38
8    Rakesh   21  86.00    11
9    Shivam   23  75.00    12
10     Rupa   24  87.25    26
11   Shreya   22  87.25    34

In [43]:
###
df = pd.read_csv('/content/sample_data/student_data_with_nans.csv')
print(df)

       Name   Age  Marks  Roll
0       Raj  18.0    NaN    10
1       Anu  17.0   90.0    25
2     Ratan  18.0   91.0    35
3   Shekhar  19.0    NaN    40
4    Namita  17.0   85.0    45
5      Amar  21.0   87.0    16
6     Nancy  22.0   88.0    17
7     Ahana   NaN   99.0    38
8    Rakesh  21.0   86.0    11
9    Shivam   NaN   75.0    12
10     Rupa  24.0   92.0    26
11   Shreya   NaN    NaN    34

In [44]:
#8
df = pd.read_csv('/content/sample_data/student_data_with_nans.csv')
print(df.head(5))

      Name   Age  Marks  Roll
0      Raj  18.0    NaN    10
1      Anu  17.0   90.0    25
2    Ratan  18.0   91.0    35
3  Shekhar  19.0    NaN    40
4   Namita  17.0   85.0    45

In [45]:
#9
print(df.loc[df['Age'].isnull()])

      Name  Age  Marks  Roll
7    Ahana  NaN   99.0    38
9   Shivam  NaN   75.0    12
11  Shreya  NaN    NaN    34

In [46]:
#10
d={
    "Name": ["Raj","Anu","Shekhar","Namita","Nancy","Ahana","Rakesh","Shivam"],
    "Salary": [18000,17500,18500,19000,17000,23000,22000,21000],
    "Department": ["IT","Sanitation","Accounts","Cashier","Stock","HR","Sales","Security"],
    "Phone Number": ['9763847201', '8123094756', '9018473629', '7839201746', '8937462017',
 '9048573621', '7890321456','9090678754']
}
df = pd.DataFrame(d)
print(df)
print("Mean Salary:", df['Salary'].mean())

      Name  Salary  Department Phone Number
0      Raj   18000          IT   9763847201
1      Anu   17500  Sanitation   8123094756
2  Shekhar   18500    Accounts   9018473629
3   Namita   19000     Cashier   7839201746
4    Nancy   17000       Stock   8937462017
5    Ahana   23000          HR   9048573621
6   Rakesh   22000       Sales   7890321456
7   Shivam   21000    Security   9090678754
Mean Salary: 19500.0

In [47]:
#11
df = pd.read_csv('/content/sample_data/student_data_with_nans.csv')
df['Marks'] = df['Marks'].fillna(75)
print(df)

       Name   Age  Marks  Roll
0       Raj  18.0   75.0    10
1       Anu  17.0   90.0    25
2     Ratan  18.0   91.0    35
3   Shekhar  19.0   75.0    40
4    Namita  17.0   85.0    45
5      Amar  21.0   87.0    16
6     Nancy  22.0   88.0    17
7     Ahana   NaN   99.0    38
8    Rakesh  21.0   86.0    11
9    Shivam   NaN   75.0    12
10     Rupa  24.0   92.0    26
11   Shreya   NaN   75.0    34

In [48]:
#12
print(df.iloc[2:6,1:4])

    Age  Marks  Roll
2  18.0   91.0    35
3  19.0   75.0    40
4  17.0   85.0    45
5  21.0   87.0    16

In [49]:
#13
print(df.loc[df['Age'] > 20])

      Name   Age  Marks  Roll
5     Amar  21.0   87.0    16
6    Nancy  22.0   88.0    17
8   Rakesh  21.0   86.0    11
10    Rupa  24.0   92.0    26

In [50]:
#14
d = {
    "Item": ["Sugar Syrup(250mL)","Milk(500mL)","Chocolate Icecream(500g)","Cups","Straws","Chocolate Chips(10g)","Oreos(small)"],
    "Quantity":[1,2,1,6,6,1,10],
    "Price":[120.00,25.00,150.00,5,1,50,5]
}
df = pd.DataFrame(d)
df['Total Price'] = df['Quantity'] * df['Price']
print(df)

                       Item  Quantity  Price  Total Price
0        Sugar Syrup(250mL)         1  120.0        120.0
1               Milk(500mL)         2   25.0         50.0
2  Chocolate Icecream(500g)         1  150.0        150.0
3                      Cups         6    5.0         30.0
4                    Straws         6    1.0          6.0
5      Chocolate Chips(10g)         1   50.0         50.0
6              Oreos(small)        10    5.0         50.0

In [51]:
#15
d = {
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Bangalore'],
    'Temperature': [35.5, NaN, 32.0, NaN, 28.5]
}

df = pd.DataFrame(d)
mean_temp = df['Temperature'].mean()
df['Temperature'] = df['Temperature'].fillna(mean_temp)
print(df)

        City  Temperature
0      Delhi         35.5
1     Mumbai         32.0
2    Kolkata         32.0
3    Chennai         32.0
4  Bangalore         28.5